*** src/hex.rs:34:13: delete match arm b'a'..= b'f' in hex_decode

*** mutation diff:
--- src/hex.rs
+++ delete match arm b'a'..= b'f' in hex_decode
@@ -26,17 +26,17 @@
     // carry: `hex[i..i + 2]` slices by byte index, so a multi-byte character
     // straddling the boundary aborted the process instead of returning `None`.
     // A hostile or broken pool could crash a miner with one such byte in a job
     // (`parse_job` runs this on `blob`, `target` and `seed_hash`).
     let raw = hex.as_bytes();
     let nibble = |c: u8| -> Option<u8> {
         match c {
             b'0'..=b'9' => Some(c - b'0'),
-            b'a'..=b'f' => Some(c - b'a' + 10),
+             /* ~ changed by cargo-mutants ~ */
             b'A'..=b'F' => Some(c - b'A' + 10),
             _ => None,
         }
     };
 
     let mut bytes = Vec::with_capacity(raw.len() / 2);
     for pair in raw.chunks_exact(2) {
         bytes.push((nibble(pair[0])? << 4) | nibble(pair[1])?);

---- hex::tests::every_byte_round_trips stdout ----

thread 'hex::tests::every_byte_round_trips' (16488054) panicked at src/hex.rs:110:9:
assertion `left == right` failed
  left: None

---- hex::tests::decodes_either_case_and_encodes_lower stdout ----

thread 'hex::tests::decodes_either_case_and_encodes_lower' (16488053) panicked at src/hex.rs:62:9:
assertion `left == right` failed
  left: Some([222, 173, 190, 239])
 right: None

---- hex::tests::round_trips stdout ----

thread 'hex::tests::round_trips' (16488057) panicked at src/hex.rs:55:9:
assertion `left == right` failed
  left: None
 right: Some([0, 15, 16, 127, 128, 255])

failures:
    hex::tests::decodes_either_case_and_encodes_lower
    hex::tests::every_byte_round_trips
    hex::tests::round_trips

test result: FAILED. 2 passed; 3 failed; 0 ignored; 0 measured; 146 filtered out; finished in 0.00s

*** result: Failure(101)
