--- src/pool_connection.rs
+++ replace == with != in take_complete_lines
@@ -870,17 +870,17 @@
 ///
 /// Splitting messages across reads is normal and must keep working, which is why
 /// the check is on the *remainder after draining* rather than on the buffer as it
 /// arrives. Returning whole lines only is also what keeps a truncated message
 /// from ever reaching `handle_pool_message`, so an oversized message cannot leave
 /// a partial job active.
 fn take_complete_lines(pending: &mut Vec<u8>) -> Result<Vec<String>, usize> {
     let mut lines = Vec::new();
-    while let Some(pos) = pending.iter().position(|&b| b == b'\n') {
+    while let Some(pos) = pending.iter().position(|&b| b != /* ~ changed by cargo-mutants ~ */ b'\n') {
         let raw: Vec<u8> = pending.drain(..=pos).collect();
         let line = String::from_utf8_lossy(&raw).trim().to_string();
         if !line.is_empty() {
             lines.push(line);
         }
     }
     if pending.len() > MAX_LINE_BYTES {
         return Err(pending.len());
