*** src/hex.rs:14:5: replace hex_decode -> Option<Vec<u8>> with Some(vec![0])

*** mutation diff:
--- src/hex.rs
+++ replace hex_decode -> Option<Vec<u8>> with Some(vec![0])
@@ -6,47 +6,17 @@
     for &b in bytes {
         s.push(HEX[(b >> 4) as usize] as char);
         s.push(HEX[(b & 0xf) as usize] as char);
     }
     s
 }
 
 pub fn hex_decode(hex: &str) -> Option<Vec<u8>> {
-    if !hex.len().is_multiple_of(2) {
-        return None;
-    }
-
-    // Decode nibble by nibble rather than via `u8::from_str_radix`, which is a
-    // *number* parser and accepts a leading sign: `from_str_radix("+1", 16)` is
-    // `Ok(1)`, so the previous implementation decoded "+1" as the byte 0x01 and
-    // "+f" as 0x0f. Hex is not arithmetic and has no sign, so that was simply
-    // wrong — found by writing this module's first tests, having been reachable
-    // from pool-supplied job fields for the project's life.
-    //
-    // Working over `as_bytes()` also removes the panic this function used to
-    // carry: `hex[i..i + 2]` slices by byte index, so a multi-byte character
-    // straddling the boundary aborted the process instead of returning `None`.
-    // A hostile or broken pool could crash a miner with one such byte in a job
-    // (`parse_job` runs this on `blob`, `target` and `seed_hash`).
-    let raw = hex.as_bytes();
-    let nibble = |c: u8| -> Option<u8> {
-        match c {
-            b'0'..=b'9' => Some(c - b'0'),
-            b'a'..=b'f' => Some(c - b'a' + 10),
-            b'A'..=b'F' => Some(c - b'A' + 10),
-            _ => None,
-        }
-    };
-
-    let mut bytes = Vec::with_capacity(raw.len() / 2);
-    for pair in raw.chunks_exact(2) {
-        bytes.push((nibble(pair[0])? << 4) | nibble(pair[1])?);
-    }
-    Some(bytes)
+    Some(vec![0]) /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
 
     #[test]
     fn round_trips() {

---- hex::tests::non_ascii_returns_none_rather_than_panicking stdout ----

thread 'hex::tests::non_ascii_returns_none_rather_than_panicking' (16500015) panicked at src/hex.rs:69:13:
assertion `left == right` failed: hex_decode("€") must return None, not panic
  left: Some([0])
 right: None

---- hex::tests::every_byte_round_trips stdout ----

thread 'hex::tests::every_byte_round_trips' (16500014) panicked at src/hex.rs:80:9:
assertion `left == right` failed
  left: Some([0])

---- hex::tests::rejects_odd_length_and_non_hex stdout ----

thread 'hex::tests::rejects_odd_length_and_non_hex' (16500016) panicked at src/hex.rs:38:9:
assertion `left == right` failed: odd length has no byte boundary
  left: Some([0])
 right: None

failures:
    hex::tests::every_byte_round_trips
    hex::tests::non_ascii_returns_none_rather_than_panicking
    hex::tests::rejects_odd_length_and_non_hex
    hex::tests::round_trips

test result: FAILED. 1 passed; 4 failed; 0 ignored; 0 measured; 146 filtered out; finished in 0.00s

*** result: Failure(101)
