*** src/hex.rs:14:8: delete ! in hex_decode

*** mutation diff:
--- src/hex.rs
+++ delete ! in hex_decode
@@ -6,17 +6,17 @@
     for &b in bytes {
         s.push(HEX[(b >> 4) as usize] as char);
         s.push(HEX[(b & 0xf) as usize] as char);
     }
     s
 }
 
 pub fn hex_decode(hex: &str) -> Option<Vec<u8>> {
-    if !hex.len().is_multiple_of(2) {
+    if  /* ~ changed by cargo-mutants ~ */hex.len().is_multiple_of(2) {
         return None;
     }
 
     // Decode nibble by nibble rather than via `u8::from_str_radix`, which is a
     // *number* parser and accepts a leading sign: `from_str_radix("+1", 16)` is
     // `Ok(1)`, so the previous implementation decoded "+1" as the byte 0x01 and
     // "+f" as 0x0f. Hex is not arithmetic and has no sign, so that was simply
     // wrong — found by writing this module's first tests, having been reachable

---- hex::tests::round_trips stdout ----

thread 'hex::tests::round_trips' (16501105) panicked at src/hex.rs:55:9:
assertion `left == right` failed
  left: None
 right: Some([0, 15, 16, 127, 128, 255])

---- hex::tests::rejects_odd_length_and_non_hex stdout ----

thread 'hex::tests::rejects_odd_length_and_non_hex' (16501104) panicked at src/hex.rs:68:9:
assertion `left == right` failed: odd length has no byte boundary
  left: Some([171])
 right: None

---- hex::tests::every_byte_round_trips stdout ----

thread 'hex::tests::every_byte_round_trips' (16501102) panicked at src/hex.rs:110:9:
assertion `left == right` failed
  left: None

failures:
    hex::tests::every_byte_round_trips
    hex::tests::rejects_odd_length_and_non_hex
    hex::tests::round_trips

test result: FAILED. 2 passed; 3 failed; 0 ignored; 0 measured; 146 filtered out; finished in 0.00s

*** result: Failure(101)
