*** src/hex.rs:33:35: replace - with + in hex_decode

*** mutation diff:
--- src/hex.rs
+++ replace - with + in hex_decode
@@ -25,17 +25,17 @@
     // Working over `as_bytes()` also removes the panic this function used to
     // carry: `hex[i..i + 2]` slices by byte index, so a multi-byte character
     // straddling the boundary aborted the process instead of returning `None`.
     // A hostile or broken pool could crash a miner with one such byte in a job
     // (`parse_job` runs this on `blob`, `target` and `seed_hash`).
     let raw = hex.as_bytes();
     let nibble = |c: u8| -> Option<u8> {
         match c {
-            b'0'..=b'9' => Some(c - b'0'),
+            b'0'..=b'9' => Some(c + /* ~ changed by cargo-mutants ~ */ b'0'),
             b'a'..=b'f' => Some(c - b'a' + 10),
             b'A'..=b'F' => Some(c - b'A' + 10),
             _ => None,
         }
     };
 
     let mut bytes = Vec::with_capacity(raw.len() / 2);
     for pair in raw.chunks_exact(2) {

---- hex::tests::round_trips stdout ----

thread 'hex::tests::round_trips' (16503337) panicked at src/hex.rs:55:9:
assertion `left == right` failed
  left: Some([96, 15, 112, 127, 224, 255])
 right: Some([0, 15, 16, 127, 128, 255])

---- hex::tests::every_byte_round_trips stdout ----

thread 'hex::tests::every_byte_round_trips' (16503334) panicked at src/hex.rs:110:9:
assertion `left == right` failed

failures:
    hex::tests::every_byte_round_trips
    hex::tests::round_trips

test result: FAILED. 3 passed; 2 failed; 0 ignored; 0 measured; 146 filtered out; finished in 0.00s

*** result: Failure(101)
