*** src/hex.rs:35:42: replace + with - in hex_decode

*** mutation diff:
--- src/hex.rs
+++ replace + with - in hex_decode
@@ -27,17 +27,17 @@
     // straddling the boundary aborted the process instead of returning `None`.
     // A hostile or broken pool could crash a miner with one such byte in a job
     // (`parse_job` runs this on `blob`, `target` and `seed_hash`).
     let raw = hex.as_bytes();
     let nibble = |c: u8| -> Option<u8> {
         match c {
             b'0'..=b'9' => Some(c - b'0'),
             b'a'..=b'f' => Some(c - b'a' + 10),
-            b'A'..=b'F' => Some(c - b'A' + 10),
+            b'A'..=b'F' => Some(c - b'A' - /* ~ changed by cargo-mutants ~ */ 10),
             _ => None,
         }
     };
 
     let mut bytes = Vec::with_capacity(raw.len() / 2);
     for pair in raw.chunks_exact(2) {
         bytes.push((nibble(pair[0])? << 4) | nibble(pair[1])?);
     }

---- hex::tests::decodes_either_case_and_encodes_lower stdout ----

thread 'hex::tests::decodes_either_case_and_encodes_lower' (16506095) panicked at src/hex.rs:35:33:
attempt to subtract with overflow

failures:
    hex::tests::decodes_either_case_and_encodes_lower

test result: FAILED. 4 passed; 1 failed; 0 ignored; 0 measured; 146 filtered out; finished in 0.00s

*** result: Failure(101)
