*** src/hex.rs:42:38: replace << with >> in hex_decode

*** mutation diff:
--- src/hex.rs
+++ replace << with >> in hex_decode
@@ -34,17 +34,17 @@
             b'a'..=b'f' => Some(c - b'a' + 10),
             b'A'..=b'F' => Some(c - b'A' + 10),
             _ => None,
         }
     };
 
     let mut bytes = Vec::with_capacity(raw.len() / 2);
     for pair in raw.chunks_exact(2) {
-        bytes.push((nibble(pair[0])? << 4) | nibble(pair[1])?);
+        bytes.push((nibble(pair[0])? >> /* ~ changed by cargo-mutants ~ */ 4) | nibble(pair[1])?);
     }
     Some(bytes)
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;

---- hex::tests::round_trips stdout ----

thread 'hex::tests::round_trips' (16508857) panicked at src/hex.rs:55:9:
assertion `left == right` failed
  left: Some([0, 15, 0, 15, 0, 15])
 right: Some([0, 15, 16, 127, 128, 255])

---- hex::tests::every_byte_round_trips stdout ----

thread 'hex::tests::every_byte_round_trips' (16508854) panicked at src/hex.rs:110:9:
assertion `left == right` failed

failures:
    hex::tests::every_byte_round_trips
    hex::tests::round_trips

test result: FAILED. 3 passed; 2 failed; 0 ignored; 0 measured; 146 filtered out; finished in 0.00s

*** result: Failure(101)
