*** src/hex.rs:42:44: replace | with ^ in hex_decode

*** mutation diff:
--- src/hex.rs
+++ replace | with ^ in hex_decode
@@ -34,17 +34,17 @@
             b'a'..=b'f' => Some(c - b'a' + 10),
             b'A'..=b'F' => Some(c - b'A' + 10),
             _ => None,
         }
     };
 
     let mut bytes = Vec::with_capacity(raw.len() / 2);
     for pair in raw.chunks_exact(2) {
-        bytes.push((nibble(pair[0])? << 4) | nibble(pair[1])?);
+        bytes.push((nibble(pair[0])? << 4) ^ /* ~ changed by cargo-mutants ~ */ nibble(pair[1])?);
     }
     Some(bytes)
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;

*** result: Success
