*** src/pool_connection.rs:877:5: replace take_complete_lines -> Result<Vec<String>, usize> with Ok(vec![])

*** mutation diff:
--- src/pool_connection.rs
+++ replace take_complete_lines -> Result<Vec<String>, usize> with Ok(vec![])
@@ -869,28 +869,17 @@
 /// stream kills the process (GitHub #21).
 ///
 /// Splitting messages across reads is normal and must keep working, which is why
 /// the check is on the *remainder after draining* rather than on the buffer as it
 /// arrives. Returning whole lines only is also what keeps a truncated message
 /// from ever reaching `handle_pool_message`, so an oversized message cannot leave
 /// a partial job active.
 fn take_complete_lines(pending: &mut Vec<u8>) -> Result<Vec<String>, usize> {
-    let mut lines = Vec::new();
-    while let Some(pos) = pending.iter().position(|&b| b == b'\n') {
-        let raw: Vec<u8> = pending.drain(..=pos).collect();
-        let line = String::from_utf8_lossy(&raw).trim().to_string();
-        if !line.is_empty() {
-            lines.push(line);
-        }
-    }
-    if pending.len() > MAX_LINE_BYTES {
-        return Err(pending.len());
-    }
-    Ok(lines)
+    Ok(vec![]) /* ~ changed by cargo-mutants ~ */
 }
 
 fn parse_job(data: &Value) -> Option<Job> {
     let blob_hex = data.get("blob")?.as_str()?;
     let target_hex = data.get("target")?.as_str()?;
     let job_id = data.get("job_id")?.as_str()?.to_string();
     let seed_hash_hex = data.get("seed_hash")?.as_str()?;

---- pool_connection::tls_tests::a_large_but_terminated_message_is_accepted stdout ----

thread 'pool_connection::tls_tests::a_large_but_terminated_message_is_accepted' (16244169) panicked at src/pool_connection.rs:1238:9:
assertion `left == right` failed
  left: 0
 right: 1

---- pool_connection::tls_tests::a_good_line_before_a_flood_is_dropped_with_the_flood stdout ----

thread 'pool_connection::tls_tests::a_good_line_before_a_flood_is_dropped_with_the_flood' (16244168) panicked at src/pool_connection.rs:1256:9:
the oversized remainder must be reported even though a good line preceded it

---- pool_connection::tls_tests::a_newline_free_stream_is_refused_instead_of_buffered stdout ----

thread 'pool_connection::tls_tests::a_newline_free_stream_is_refused_instead_of_buffered' (16244171) panicked at src/pool_connection.rs:1200:26:
buffer grew past the limit without being refused: 1052672 bytes

failures:
    pool_connection::tls_tests::a_good_line_before_a_flood_is_dropped_with_the_flood
    pool_connection::tls_tests::a_large_but_terminated_message_is_accepted
    pool_connection::tls_tests::a_newline_free_stream_is_refused_instead_of_buffered
    pool_connection::tls_tests::a_trailing_partial_line_is_kept_for_the_next_read
    pool_connection::tls_tests::several_lines_in_one_read_all_come_out_in_order
    pool_connection::tls_tests::splitting_a_message_across_reads_still_parses
    pool_connection::tls_tests::the_first_job_after_a_flood_is_not_swallowed_by_the_stale_buffer
    pool_connection::tls_tests::the_limit_is_exact_and_not_off_by_one
    pool_connection::tls_tests::the_receiver_loop_really_drops_a_newline_free_stream

test result: FAILED. 149 passed; 9 failed; 2 ignored; 0 measured; 0 filtered out; finished in 187.72s

*** result: Failure(101)
