*** src/pool_connection.rs:881:12: delete ! in take_complete_lines

*** mutation diff:
--- src/pool_connection.rs
+++ delete ! in take_complete_lines
@@ -873,17 +873,17 @@
 /// arrives. Returning whole lines only is also what keeps a truncated message
 /// from ever reaching `handle_pool_message`, so an oversized message cannot leave
 /// a partial job active.
 fn take_complete_lines(pending: &mut Vec<u8>) -> Result<Vec<String>, usize> {
     let mut lines = Vec::new();
     while let Some(pos) = pending.iter().position(|&b| b == b'\n') {
         let raw: Vec<u8> = pending.drain(..=pos).collect();
         let line = String::from_utf8_lossy(&raw).trim().to_string();
-        if !line.is_empty() {
+        if  /* ~ changed by cargo-mutants ~ */line.is_empty() {
             lines.push(line);
         }
     }
     if pending.len() > MAX_LINE_BYTES {
         return Err(pending.len());
     }
     Ok(lines)
 }

---- pool_connection::tls_tests::a_trailing_partial_line_is_kept_for_the_next_read stdout ----

thread 'pool_connection::tls_tests::a_trailing_partial_line_is_kept_for_the_next_read' (16257730) panicked at src/pool_connection.rs:1190:9:
assertion `left == right` failed
  left: []
 right: ["done"]

---- pool_connection::tls_tests::several_lines_in_one_read_all_come_out_in_order stdout ----

thread 'pool_connection::tls_tests::several_lines_in_one_read_all_come_out_in_order' (16257737) panicked at src/pool_connection.rs:1183:9:
assertion `left == right` failed
  left: []
 right: ["one", "two", "three"]

---- pool_connection::tls_tests::splitting_a_message_across_reads_still_parses stdout ----

thread 'pool_connection::tls_tests::splitting_a_message_across_reads_still_parses' (16257738) panicked at src/pool_connection.rs:1173:9:
assertion `left == right` failed
  left: []
 right: ["{\"id\":1,\"x\":2}"]

failures:
    pool_connection::tls_tests::a_large_but_terminated_message_is_accepted
    pool_connection::tls_tests::a_trailing_partial_line_is_kept_for_the_next_read
    pool_connection::tls_tests::several_lines_in_one_read_all_come_out_in_order
    pool_connection::tls_tests::splitting_a_message_across_reads_still_parses
    pool_connection::tls_tests::the_first_job_after_a_flood_is_not_swallowed_by_the_stale_buffer

test result: FAILED. 153 passed; 5 failed; 2 ignored; 0 measured; 0 filtered out; finished in 187.90s

*** result: Failure(101)
