*** src/pool_connection.rs:885:22: replace > with == in take_complete_lines

*** mutation diff:
--- src/pool_connection.rs
+++ replace > with == in take_complete_lines
@@ -877,17 +877,17 @@
     let mut lines = Vec::new();
     while let Some(pos) = pending.iter().position(|&b| b == b'\n') {
         let raw: Vec<u8> = pending.drain(..=pos).collect();
         let line = String::from_utf8_lossy(&raw).trim().to_string();
         if !line.is_empty() {
             lines.push(line);
         }
     }
-    if pending.len() > MAX_LINE_BYTES {
+    if pending.len() == /* ~ changed by cargo-mutants ~ */ MAX_LINE_BYTES {
         return Err(pending.len());
     }
     Ok(lines)
 }
 
 fn parse_job(data: &Value) -> Option<Job> {
     let blob_hex = data.get("blob")?.as_str()?;
     let target_hex = data.get("target")?.as_str()?;

---- pool_connection::tls_tests::a_good_line_before_a_flood_is_dropped_with_the_flood stdout ----

thread 'pool_connection::tls_tests::a_good_line_before_a_flood_is_dropped_with_the_flood' (16261126) panicked at src/pool_connection.rs:1267:9:
the oversized remainder must be reported even though a good line preceded it

---- pool_connection::tls_tests::the_limit_is_exact_and_not_off_by_one stdout ----

thread 'pool_connection::tls_tests::the_limit_is_exact_and_not_off_by_one' (16261145) panicked at src/pool_connection.rs:1235:9:
exactly the limit must be allowed

---- pool_connection::tls_tests::a_newline_free_stream_is_refused_instead_of_buffered stdout ----

thread 'pool_connection::tls_tests::a_newline_free_stream_is_refused_instead_of_buffered' (16261129) panicked at src/pool_connection.rs:1217:21:
assertion failed: overflow > MAX_LINE_BYTES

failures:
    pool_connection::tls_tests::a_good_line_before_a_flood_is_dropped_with_the_flood
    pool_connection::tls_tests::a_newline_free_stream_is_refused_instead_of_buffered
    pool_connection::tls_tests::the_limit_is_exact_and_not_off_by_one

test result: FAILED. 155 passed; 3 failed; 2 ignored; 0 measured; 0 filtered out; finished in 185.94s

*** result: Failure(101)
