*** src/pool_connection.rs:885:22: replace > with < in take_complete_lines

*** mutation diff:
--- src/pool_connection.rs
+++ replace > with < in take_complete_lines
@@ -877,17 +877,17 @@
     let mut lines = Vec::new();
     while let Some(pos) = pending.iter().position(|&b| b == b'\n') {
         let raw: Vec<u8> = pending.drain(..=pos).collect();
         let line = String::from_utf8_lossy(&raw).trim().to_string();
         if !line.is_empty() {
             lines.push(line);
         }
     }
-    if pending.len() > MAX_LINE_BYTES {
+    if pending.len() < /* ~ changed by cargo-mutants ~ */ MAX_LINE_BYTES {
         return Err(pending.len());
     }
     Ok(lines)
 }
 
 fn parse_job(data: &Value) -> Option<Job> {
     let blob_hex = data.get("blob")?.as_str()?;
     let target_hex = data.get("target")?.as_str()?;

---- pool_connection::tls_tests::a_newline_free_stream_is_refused_instead_of_buffered stdout ----

thread 'pool_connection::tls_tests::a_newline_free_stream_is_refused_instead_of_buffered' (16264309) panicked at src/pool_connection.rs:1217:21:
assertion failed: overflow > MAX_LINE_BYTES

---- pool_connection::tls_tests::a_trailing_partial_line_is_kept_for_the_next_read stdout ----

thread 'pool_connection::tls_tests::a_trailing_partial_line_is_kept_for_the_next_read' (16264313) panicked at src/pool_connection.rs:1190:54:
called `Result::unwrap()` on an `Err` value: 7

---- pool_connection::tls_tests::several_lines_in_one_read_all_come_out_in_order stdout ----

thread 'pool_connection::tls_tests::several_lines_in_one_read_all_come_out_in_order' (16264320) panicked at src/pool_connection.rs:1183:54:
called `Result::unwrap()` on an `Err` value: 0

failures:
    pool_connection::tls_tests::a_good_line_before_a_flood_is_dropped_with_the_flood
    pool_connection::tls_tests::a_large_but_terminated_message_is_accepted
    pool_connection::tls_tests::a_newline_free_stream_is_refused_instead_of_buffered
    pool_connection::tls_tests::a_trailing_partial_line_is_kept_for_the_next_read
    pool_connection::tls_tests::several_lines_in_one_read_all_come_out_in_order
    pool_connection::tls_tests::splitting_a_message_across_reads_still_parses
    pool_connection::tls_tests::the_first_job_after_a_flood_is_not_swallowed_by_the_stale_buffer
    pool_connection::tls_tests::the_limit_is_exact_and_not_off_by_one

test result: FAILED. 150 passed; 8 failed; 2 ignored; 0 measured; 0 filtered out; finished in 187.79s

*** result: Failure(101)
